In [3]:
import pandas as pd

In [4]:
import numpy as np

In [5]:
from numpy.random import randn

In [6]:
np.random.seed(100)

In [7]:
df = pd.DataFrame( randn(5,4), ['A', 'B', 'C', 'D', 'E'], [1,2,3,4])

In [8]:
df

          1         2         3         4
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [9]:
df[2]

A    0.342680
B    0.514219
C    0.255001
D    0.816847
E    1.029733
Name: 2, dtype: float64

In [10]:
 type(df[2])

pandas.core.series.Series

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:
df['A']

KeyError: 'A'

In [13]:
df[[2,4]]

          2         4
A  0.342680 -0.252436
B  0.514219 -1.070043
C  0.255001  0.435163
D  0.816847 -0.104411
E  1.029733 -1.118318

In [14]:
df['new'] = df[1] + df[3]

In [15]:
df

          1         2         3         4       new
A -1.749765  0.342680  1.153036 -0.252436 -0.596730
B  0.981321  0.514219  0.221180 -1.070043  1.202500
C -0.189496  0.255001 -0.458027  0.435163 -0.647523
D -0.583595  0.816847  0.672721 -0.104411  0.089126
E -0.531280  1.029733 -0.438136 -1.118318 -0.969416

In [16]:
df.drop('new', axis = 1, inplace = True )

In [17]:
df

          1         2         3         4
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [18]:
  df.drop('E')

          1         2         3         4
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411

In [19]:
df.shape

(5, 4)

### Selecting Row

In [20]:
df.loc['D']

1   -0.583595
2    0.816847
3    0.672721
4   -0.104411
Name: D, dtype: float64

In [21]:
df.iloc[3]

1   -0.583595
2    0.816847
3    0.672721
4   -0.104411
Name: D, dtype: float64

In [22]:
df.loc['C', 2]

0.25500144427338167

In [23]:
df.loc[['A', 'C'], [2,3]]

          2         3
A  0.342680  1.153036
C  0.255001 -0.458027

In [24]:
df > 0

       1     2      3      4
A  False  True   True  False
B   True  True   True  False
C  False  True  False   True
D  False  True   True  False
E  False  True  False  False

In [27]:
booldf = df > 0

In [28]:
booldf

       1     2      3      4
A  False  True   True  False
B   True  True   True  False
C  False  True  False   True
D  False  True   True  False
E  False  True  False  False

In [29]:
df[booldf]

          1         2         3         4
A       NaN  0.342680  1.153036       NaN
B  0.981321  0.514219  0.221180       NaN
C       NaN  0.255001       NaN  0.435163
D       NaN  0.816847  0.672721       NaN
E       NaN  1.029733       NaN       NaN

In [30]:
df[ df > 0 ]

          1         2         3         4
A       NaN  0.342680  1.153036       NaN
B  0.981321  0.514219  0.221180       NaN
C       NaN  0.255001       NaN  0.435163
D       NaN  0.816847  0.672721       NaN
E       NaN  1.029733       NaN       NaN

In [31]:
df[ df[1] > 0]

          1         2        3         4
B  0.981321  0.514219  0.22118 -1.070043

In [32]:
df[ df[1] > 0][3]

B    0.22118
Name: 3, dtype: float64

In [33]:
 df[ df[1] > 0][[1,3]]

          1        3
B  0.981321  0.22118

In [34]:
df

          1         2         3         4
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [35]:
df.reset_index()

  index         1         2         3         4
0     A -1.749765  0.342680  1.153036 -0.252436
1     B  0.981321  0.514219  0.221180 -1.070043
2     C -0.189496  0.255001 -0.458027  0.435163
3     D -0.583595  0.816847  0.672721 -0.104411
4     E -0.531280  1.029733 -0.438136 -1.118318

In [36]:
newind = 'CA NY WY OR CO'.split()

In [37]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [38]:
df['STATES'] = newind

In [39]:
df

          1         2         3         4 STATES
A -1.749765  0.342680  1.153036 -0.252436     CA
B  0.981321  0.514219  0.221180 -1.070043     NY
C -0.189496  0.255001 -0.458027  0.435163     WY
D -0.583595  0.816847  0.672721 -0.104411     OR
E -0.531280  1.029733 -0.438136 -1.118318     CO

In [40]:
 df.set_index('STATES')

               1         2         3         4
STATES
CA     -1.749765  0.342680  1.153036 -0.252436
NY      0.981321  0.514219  0.221180 -1.070043
WY     -0.189496  0.255001 -0.458027  0.435163
OR     -0.583595  0.816847  0.672721 -0.104411
CO     -0.531280  1.029733 -0.438136 -1.118318

In [41]:
df

          1         2         3         4 STATES
A -1.749765  0.342680  1.153036 -0.252436     CA
B  0.981321  0.514219  0.221180 -1.070043     NY
C -0.189496  0.255001 -0.458027  0.435163     WY
D -0.583595  0.816847  0.672721 -0.104411     OR
E -0.531280  1.029733 -0.438136 -1.118318     CO

In [42]:
 df.set_index('STATES', inplace = True)

In [43]:
df

               1         2         3         4
STATES
CA     -1.749765  0.342680  1.153036 -0.252436
NY      0.981321  0.514219  0.221180 -1.070043
WY     -0.189496  0.255001 -0.458027  0.435163
OR     -0.583595  0.816847  0.672721 -0.104411
CO     -0.531280  1.029733 -0.438136 -1.118318